Repository: altendorfme/gitium
Catalog: languages/gitium-*.po
Languages: pt_br

source: Git Configuration
pt_br: Configuração do Git

source: Configuration
pt_br: Configuração

source: Keypair successfully regenerated.
pt_br: Keypair regerada com sucesso.

source: Initial commit
pt_br: Primeiro commit

source: Please specify a valid repo.
pt_br: Por favor, especifique um repositório válido.

source: Could not push to remote
pt_br: Não foi possível enviar para o remoto

source: Merged existing code from
pt_br: Código existente mergeado de

source: Could not create initial commit ->
pt_br: Não foi possível criar o commit inicial ->

source: Could not merge the initial commit ->
pt_br: Não foi possível mergear o commit inicial ->

source: Remote URL
pt_br: URL Remota

source: This URL provide access to a Git repository via SSH, HTTPS, or Subversion.
pt_br: Essa URL fornece acesso a um repositório Git via SSH, HTTPS ou Subversion.

source: If you need to authenticate over "https://" instead of SSH use: <code>https://user:pass@github.com/user/example.git</code>
pt_br: Se você precisar autenticar por "https://" em vez de SSH, use: <code>https://user:pass@github.com/user/example.git</code>

source: Regenerate Key
pt_br: Regenerar chave

source: If your code use ssh keybased authentication for git you need to allow write access to your repository using this key.
pt_br: Se o seu código usa autenticação baseada em chave ssh para git, você precisa permitir acesso de gravação ao seu repositório usando essa chave.

source: Checkout instructions for <a href="https://help.github.com/articles/generating-ssh-keys#step-3-add-your-ssh-key-to-github" target="_blank">github</a> or <a href="https://confluence.atlassian.com/display/BITBUCKET/Add+an+SSH+key+to+an+account#AddanSSHkeytoanaccount-HowtoaddakeyusingSSHforOSXorLinux" target="_blank">bitbucket</a>.
pt_br: Instruções de checkout para <a href="https://help.github.com/articles/generating-ssh-keys#step-3-add-your-ssh-key-to-github" target="_blank">github</a> ou <a href="https://confluence.atlassian.com/display/BITBUCKET/Add+an+SSH+key+to+an+account#AddanSSHkeytoanaccount-HowtoaddakeyusingSSHforOSXorLinux" target="_blank">bitbucket</a>.

source: Warning!
pt_br: Aviso!

source: Configuration step 1
pt_br: Etapa de configuração 1

source: If you need help to set this up, please click on the "Help" button from the top right corner of this screen.
pt_br: Se precisar de ajuda para configurar, clique no botão "Ajuda" no canto superior direito.

source: Fetch
pt_br: Fetch (Buscar)

source: Configuration step 2
pt_br: Etapa de configuração 2

source: Choose tracking branch
pt_br: Escolha o ramo de rastreamento

source: Git Status
pt_br: Status do Git

source: The file `.gitignore` is saved!
pt_br: O arquivo `.gitignore` foi salvo!

source: The file `.gitignore` could not be saved!
pt_br: O arquivo `.gitignore` não pôde ser salvo!

source: Could not enable the maintenance mode!
pt_br: Não foi possível ativar o modo de manutenção!

source: Merged changes from %s on %s
pt_br: [auto]: merged changes from %s on %s

source: Could not commit!
pt_br: Não foi possível commitar!

source: Merge failed:
pt_br: Falha ao mergear:

source: Pushed commit: `%s`
pt_br: Commit enviado: `%s`

source: Following remote branch <code>%s</code>.
pt_br: Seguindo a remote branch <code>%s</code>.

source: Everything is up to date
pt_br: Tudo está atualizado

source: You are %s commits ahead and %s behind remote.
pt_br: Você está %s commits à frente e %s atrás remote.

source: You are %s commits ahead remote.
pt_br: Você está %s commits à frente do remote.

source: You are %s commits behind remote.
pt_br: Você está %s commits atrás do remote.

source: Add this file to the `.gitignore` list.
pt_br: Adicione este arquivo à lista `.gitignore`.

source: Submodules are not supported in this version.
pt_br: Os submódulos não são suportados nesta versão.

source: Path
pt_br: Caminho

source: Change
pt_br: Mudar

source: Nothing to commit, working directory clean.
pt_br: Nada para commitar, diretório de trabalho limpo.

source: Commit message
pt_br: Mensagem do commit

source: Save changes
pt_br: Salvar alterações

source: connected to
pt_br: conectado a

source: Settings
pt_br: Configurações

source: Webhook URL regenerates. Please make sure you update any external references.
pt_br: O URL do webhook foi regenerada. Certifique-se de atualizar quaisquer referências externas.

source: Public key successfully regenerated.
pt_br: Chave pública regenerada com sucesso.

source: Webhook URL
pt_br: URL do webhook

source: Regenerate Webhook
pt_br: Regenerar Webhook

source: Pinging this URL triggers an update from remote repository.
pt_br: Faça um ping nessa URL para uma atualização do repositório remoto.

source: Public Key
pt_br: Chave pública

source: Gitium Settings
pt_br: Configurações do Gitium

source: Be careful when you modify this list!
pt_br: Tenha cuidado ao modificar esta lista!

source: Save
pt_br: Salvar

source: Gitium enables continuous deployment for WordPress integrating with tools such as Github, Bitbucket or Travis-CI. Plugin and theme updates, installs and removals are automatically versioned.
pt_br: O Gitium permite a implantação contínua do WordPress integrando-se a ferramentas como Github, Bitbucket ou Travis-CI. Atualizações, instalações e remoções de plugins e temas são automaticamente versionadas.

source: Ninja code edits from the WordPress editor are also tracked into version control. Gitium is designed for sane development environments.
pt_br: As edições de código no editor do WordPress também são rastreadas no controle de versão. O Gitium foi projetado para ambientes de desenvolvimento.

source: Staging and production can follow different branches of the same repository. You can deploy code simply trough git push.
pt_br: Ambientes de stagings e produção podem seguir diferentes branches no mesmo repositório. Você pode implantar o código simplesmente por meio do git push.

source: Gitium requires <code>git</code> command line tool minimum version 1.7 installed on the server and <code>proc_open</code> PHP function enabled.
pt_br: O Gitium requer o componente <code>git</code> na versão mínima 1.7 instalada no servidor e a função PHP <code>proc_open</code> habilitada.

source: Is this plugin considered stable?
pt_br: Este plugin é considerado estável?

source: Right now this plugin is considered alpha quality and should be used in production environments only by adventurous kinds.
pt_br: No momento, este plugin é considerado em alpha e deve ser usado em ambientes de produção apenas por curiosidade.

source: What happens in case of conflicts?
pt_br: O que acontece em caso de conflitos?

source: The behavior in case of conflicts is to overwrite the changes on the origin repository with the local changes (ie. local modifications take precedence over remote ones).
pt_br: Em caso de conflitos irá sobrescrever as alterações no repositório de origem com as alterações locais (ou seja, as modificações locais têm precedência sobre as remotas).

source: How to deploy automatically after a push?
pt_br: Como implantar automaticamente após um push?

source: You can ping the webhook url after a push to automatically deploy the new code. The webhook url can be found under Code menu. This url plays well with Github or Bitbucket webhooks.
pt_br: Você pode fazer ping na URL do webhook após um push para implantar automaticamente o novo código. O URL do webhook pode ser encontrado no menu Configurações. Esta URL funciona bem com os webhooks do Github ou Bitbucket.

source: Does it works on multi site setups?
pt_br: Funciona em configurações de multisite?

source: Gitium is not supporting multisite setups at the moment.
pt_br: O Gitium não suporta configurações multisite no momento.

source: How does gitium handle submodules?
pt_br: Como o gitium lida com submódulos?

source: Currently submodules are not supported.
pt_br: Atualmente os submódulos não são suportados.

source: In this step you must specify the <code>Remote URL</code>. This URL represents the link between the git sistem and your site.
pt_br: Nesta etapa você deve especificar o <code>URL Remoto</code>. Este URL representa o link entre o sistema git e seu site.

source: You can get this URL from your Git repository and it looks like this:
pt_br: Você pode obter este URL do seu repositório Git e se parece com isso:

source: To go to the next step, fill the <code>Remote URL</code> and then press the <code>Fetch</code> button.
pt_br: Para ir para a próxima etapa, preencha o <code>URL Remoto</code> e pressione o botão <code>Buscar (Fetch)</code>.

source: In this step you must select the <code>branch</code> you want to follow.
pt_br: Nesta etapa você deve selecionar o <code>branch</code> que deseja.

source: Only this branch will have all of your code modifications.
pt_br: Somente esta branch terá todas as suas modificações de código.

source: When you push the button <code>Merge & Push</code>, all code(plugins & themes) will be pushed on the git repository.
pt_br: Quando você pressiona o botão <code>Merge & Push</code>, todo o código (plugins e temas) será enviado para o repositório git.

source: On status page you can see what files are modified, and you can commit the changes to git.
pt_br: Na página de status, você pode ver quais arquivos foram modificados e pode confirmar as alterações no git.

source: You may be wondering what is the difference between author and committer.
pt_br: Você pode estar se perguntando qual é a diferença entre autor e committer.

source: The <code>author</code> is the person who originally wrote the patch, whereas the <code>committer</code> is the person who last applied the patch.
pt_br: O <code>autor</code> é a pessoa que escreveu originalmente o patch, enquanto o <code>committer</code> é a pessoa que aplicou o patch pela última vez.

source: So, if you send in a patch to a project and one of the core members applies the patch, both of you get credit — you as the author and the core member as the committer.
pt_br: Portanto, se você enviar um patch para um projeto e um dos membros principais aplicar o patch, ambos receberão crédito - você como autor e o membro principal como committer.

source: Each line from the gitignore file specifies a pattern.
pt_br: Cada linha do arquivo gitignore especifica um padrão.

source: When deciding whether to ignore a path, Git normally checks gitignore patterns from multiple sources, with the following order of precedence, from highest to lowest (within one level of precedence, the last matching pattern decides the outcome)
pt_br: Ao decidir ignorar um caminho, o Git normalmente verifica os padrões gitignore de várias fontes, com a seguinte ordem de precedência, do maior para o menor (dentro de um nível de precedência, o último padrão correspondente decide o resultado)

source: Read more on %s
pt_br: Leia mais em %s

source: Git Commits
pt_br: Commits do Git

source: Last %s commits
pt_br: Últimos %s commits

source: committed %s ago
pt_br: commitado %s atrás

source: authored %s ago
pt_br: criado %s atrás
